# MepEquipmentCalcPipingpressuredropParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepEquipmentCalcPipingpressuredropParam Property
ParameterTypeId Class See Also
---
"Calculated Pressure Drop"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepEquipmentCalcPipingpressuredropParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepEquipmentCalcPipingpressuredropParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepEquipmentCalcPipingpressuredropParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace